{"format": "layers-model", "generatedBy": "keras v2.20.1", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.20.1", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "module", "trainable": true, "dtype": "float32", "units": 11, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "module", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "inverter", "trainable": true, "dtype": "float32", "units": 9, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inverter", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "power", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "power", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "nmod", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "nmod", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "ninv", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "ninv", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "total_ipmd", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "total_ipmd", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "total_ipinv", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "total_ipinv", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "ipsys", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "ipsys", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["module", 0, 0], ["inverter", 0, 0], ["power", 0, 0], ["nmod", 0, 0], ["ninv", 0, 0], ["total_ipmd", 0, 0], ["total_ipinv", 0, 0], ["ipsys", 0, 0]]}}, "training_config": {"loss": {"module": "sparse_categorical_crossentropy", "inverter": "sparse_categorical_crossentropy", "power": "mse", "nmod": "mse", "ninv": "mse", "total_ipmd": "mse", "total_ipinv": "mse", "ipsys": "mse"}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "module_accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}], [{"class_name": "MeanMetricWrapper", "config": {"name": "inverter_accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}], [{"class_name": "MeanMetricWrapper", "config": {"name": "power_mae", "dtype": "float32", "fn": "mean_absolute_error"}}], [{"class_name": "MeanMetricWrapper", "config": {"name": "nmod_mae", "dtype": "float32", "fn": "mean_absolute_error"}}], [{"class_name": "MeanMetricWrapper", "config": {"name": "ninv_mae", "dtype": "float32", "fn": "mean_absolute_error"}}], [{"class_name": "MeanMetricWrapper", "config": {"name": "total_ipmd_mae", "dtype": "float32", "fn": "mean_absolute_error"}}], [{"class_name": "MeanMetricWrapper", "config": {"name": "total_ipinv_mae", "dtype": "float32", "fn": "mean_absolute_error"}}], [{"class_name": "MeanMetricWrapper", "config": {"name": "ipsys_mae", "dtype": "float32", "fn": "mean_absolute_error"}}]], "weighted_metrics": null, "loss_weights": {"module": 3.0, "inverter": 3.0, "power": 2.0, "nmod": 1.0, "ninv": 1.0, "total_ipmd": 1.0, "total_ipinv": 1.0, "ipsys": 1.5}, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [4, 128], "dtype": "float32"}, {"name": "dense/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [64], "dtype": "float32"}, {"name": "inverter/kernel", "shape": [64, 9], "dtype": "float32"}, {"name": "inverter/bias", "shape": [9], "dtype": "float32"}, {"name": "ipsys/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "ipsys/bias", "shape": [1], "dtype": "float32"}, {"name": "module/kernel", "shape": [64, 11], "dtype": "float32"}, {"name": "module/bias", "shape": [11], "dtype": "float32"}, {"name": "ninv/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "ninv/bias", "shape": [1], "dtype": "float32"}, {"name": "nmod/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "nmod/bias", "shape": [1], "dtype": "float32"}, {"name": "power/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "power/bias", "shape": [1], "dtype": "float32"}, {"name": "total_ipinv/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "total_ipinv/bias", "shape": [1], "dtype": "float32"}, {"name": "total_ipmd/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "total_ipmd/bias", "shape": [1], "dtype": "float32"}]}]}